Tekla Open API Reference for Tekla Structures 2025
PluginNameAttribute Class
 Not supported at the moment.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.PluginNameAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class PluginNameAttribute : Attribute
Public NotInheritable Class PluginNameAttribute
	Inherits Attribute
The PluginNameAttribute type exposes the following members.
Constructors
Name | Description
PluginNameAttribute
 Not supported at the moment.
Top
Properties
Name | Description
Language
 Not supported at the moment.
Name
 Not supported at the moment.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace